[
   {
      "@id": "javascript_quads",
      "name": "Javascript Quads",
      "icon": "img/icons/js.png",
      "hostedUrl": "quad.html",
      "description": "A Javacscript program that takes an image and segments it into 4 quadrants and then draws the average color for that segment. Then it determines the average error of color for each of the segments and then segments that quadrant again. This will ultimately leave the less detailed areas with larger squares while it continues to refine more detailed areas."
   },
   {
      "@id": "nacka_app",
      "name": "NACKA Kickball App",
      "icon": "https://lh6.ggpht.com/Gp0w42XVPMkfrxRYD2o_ZrAJaY5tDWC4AsA53Jwtt8xTw1f-o1ydH-M2HvYQ5CH61nY=w300",
      "hostedUrl": "https://play.google.com/store/apps/details?id=com.nacka_kickball",
      "description": "Playing in Rochester's NACKA Kickball League? Need to check on your teams latest game information, then this the app for you. This app will pull relevant information for the NACKA website and compile it to a mobile friendly version for your phone."
   },
   {
       "@id": "bpms",
       "name": "Beer Pong Management System v1.8",
       "icon": "img/icons/pong/v2_upgrade.ico",
       "hostedUrl": "data/code/BPMS_1.8.zip",
       "description": "This is a .Net 3.5 Windows forms project that is designed to maintain a few aspects of a beer pong table during a party. At the moment this will allow people to queue up (and give themselves a team name), getting in line again with the same team later, removal from the line. There is also admin password that can be used to modify different features and lock the average user from changing it, it also keeps track of basic stats, like longest win streak."
    },
   {
      "@id": "youtube_embeder",
      "name": "Youtube Embeder",
      "icon": "http://c.fsdn.com/allura/p/greasemonkey/icon",
      "hostedUrl": "https://github.com/SwiftStriker00/Youtube-Embeder",
      "description": "The Youtube Embeder script adds a button to your collection and subscription pages. The button will replace the description and view count with a new button that will allow you to watch the youtube video embedded right into the page, without having to navigate as well. It will also apply the 'watched' feature to the header icon"
   },
   {
      "@id": "JungleTimer",
      "name": "Jungle Timer",
      "icon": "img/icons/jungleTimer.ico",
      "hostedUrl": "data/code/JungleTimer_0.6.zip",
      "description": "JungleTimer is an auxiliary tool for the game League of Legends. It allows the user to track the \"jungle creeps.\" This tool will hopefully help newer junglers and experience ones as well. The only requirement to run this is to have .NET 4.0 Framework."
   },
   {
      "@id": "EFSHunter",
      "name": "EFS Hunter",
      "icon": "img/icons/efshunter.ico",
      "hostedUrl": "data/code/EFS_Hunter.zip",
      "description": "After re-installing my OS, I didn't realize that half my files were encrypted. I lost a lot of data, so I created this tool to help prevent that in the future. This is a small utility tool to look for encrypted files. It will export a list to your desktop. To use, just put the .exe in the root directory of where you want to start you search."
   },
   {
      "@id": "mp3renamer",
      "name": "MP3 Renamer",
      "icon": "img/icons/file_mp3.png",
      "hostedUrl": "data/code/MP3Renamer.zip",
      "description": "This is one of the first programs I wrote. It goes through the directory its run in and renames all the music files\n\t\t\t\tbased on their ID3 tags."
   }
]